boussinesq_pipe_heatExchg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (-3 -4 0)
    (3 -4 0)
    (3 4 0)
    (-3 4 0)
    (-3 -4 400)
    (3 -4 400)
    (3 4 400)
    (-3 4 400)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) cylinder (10 10 200) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (0 -5 0)
    arc 1 2 (5 0 0)
    arc 2 3 (0 5 0)
    arc 3 0 (-5 0 0)
    arc 4 5 (0 -5 400)
    arc 5 6 (5 0 400)
    arc 6 7 (0 5 400)
    arc 7 4 (-5 0 400)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
